# 24년 개정 직매입 표준거래계약서(면세점) 15조
origin ="""
    제15조 [보복조치의 금지]
    ① “갑”은 “을”이 다음 각 호의 어느 하나에 해당하는 행위를 한 것을 이유로 “을”에게 불리하게 계약조건을 변경하는 행위, 납품이나 매장 임차의 기회를 제한하는 행위 또는 계약의 이행과정에서 불이익을 주는 행위를 하여서는 아니 된다.
    1. 「대규모유통업에서의 거래 공정화에 관한 법률」 제25조에 따른 분쟁조정의 신청
    2. 「대규모유통업에서의 거래 공정화에 관한 법률」 제29조제1항에 따른 신고
    3. 「대규모유통업에서의 거래 공정화에 관한 법률」 제30조에 따른 서면실태조사에 응하여 자료 제출 등의 방식으로 공정거래위원회에 협조하는 행위
    4. 「독점규제 및 공정거래에 관한 법률」 제50조에 따른 공정거래위원회의 조사에 대한 협조
 """


law ="""
        "article_number": "Article 18",
        "article_title": "보복조치의 금지",
        "article_content": "대규모유통업자는 납품업자등이 다음 각 호의 어느 하나에 해당하는 행위를 한 것을 이유로 납품업자등에게 불리하게 계약조건을 변경하는 행위, 납품이나 매장 임차의 기회를 제한하는 행위 또는 계약의 이행과정에서 불이익을 주는 행위를 하여서는 아니 된다.",
"""
##########################################################################################################################################################
# 시나리오 1:
##########################################################################################################################################################
# 원본
s1 ="""

    """
# 1항에 대한 불공정
s1_1_1 = """

    """
s1_1_2 = """

    """
# 새로운 항에 대한 불공정
s1_new_1 = """

    """
s1_new_2 = """

    """
##########################################################################################################################################################
# 시나리오 2:
##########################################################################################################################################################
# 원본
s2 ="""

    """
# 1항에 대한 불공정
s2_1_1 = """

    """
s2_1_2 = """

    """
# 새로운 항에 대한 불공정
s2_new_1 = """

    """
s2_new_2 = """

    """
##########################################################################################################################################################
# 시나리오 3:
##########################################################################################################################################################
# 원본
s3 ="""

    """
# 1항에 대한 불공정
s3_1_1 = """

    """
s3_1_2 = """

    """
# 새로운 항에 대한 불공정
s3_new_1 = """

    """
s3_new_2 = """

    """
##########################################################################################################################################################
# 시나리오 4:
##########################################################################################################################################################
# 원본
s4 ="""

    """
# 1항에 대한 불공정
s4_1_1 = """

    """
s4_1_2 = """

    """
# 새로운 항에 대한 불공정
s4_new_1 = """

    """
s4_new_2 = """

    """
##########################################################################################################################################################
# 시나리오 5:
##########################################################################################################################################################
# 원본
s5 ="""

    """
# 1항에 대한 불공정
s5_1_1 = """

    """
s5_1_2 = """

    """
# 새로운 항에 대한 불공정
s5_new_1 = """

    """
s5_new_2 = """

    """
##########################################################################################################################################################
# 시나리오 6:
##########################################################################################################################################################
# 원본
s6 ="""

    """
# 1항에 대한 불공정
s6_1_1 = """

    """
s6_1_2 = """

    """
# 새로운 항에 대한 불공정
s6_new_1 = """

    """
s6_new_2 = """

    """
##########################################################################################################################################################
# 시나리오 7:
##########################################################################################################################################################
# 원본
t1 ="""

    """
# 1항에 대한 불공정
t1_1_1 = """

    """
# 새로운 항에 대한 불공정
t1_new_1 = """

    """
##########################################################################################################################################################
# 시나리오 8:
##########################################################################################################################################################
# 원본
t2 ="""

    """
# 1항에 대한 불공정
t2_1_1 = """

    """
# 새로운 항에 대한 불공정
t2_new_1 = """

    """
##########################################################################################################################################################
# 시나리오 9:
##########################################################################################################################################################
# 원본
t3 ="""

    """
# 1항에 대한 불공정
t3_1_1 = """

    """
# 새로운 항에 대한 불공정
t3_new_1 = """

    """
##########################################################################################################################################################
# 라벨링
##########################################################################################################################################################
s_1_label =[
    [15, 1, 0, 1, 15],
    [15, 1, 1, 0, 0],
    [15, 1, 2, 0, 0],
    [15, 1, 3, 0, 0],
    [15, 1, 4, 0, 0],
]
s_new_label =[
    [15, 1, 0, 0, 0],
    [15, 1, 1, 0, 0],
    [15, 1, 2, 0, 0],
    [15, 1, 3, 0, 0],
    [15, 1, 4, 0, 0],
    [15, 2, 0, 1, 15],
]
##########################################################################################################################################################
# csv
##########################################################################################################################################################

def to_list(data, labels):
    labels_copy = [label.copy() for label in labels]  # 각 요소를 복사
    for label in labels_copy:
        label.append(data)
    return labels_copy


s1_1_1_label = to_list(s1_1_1,s_1_label)
s2_1_1_label = to_list(s2_1_1,s_1_label)
s3_1_1_label = to_list(s3_1_1,s_1_label)
s4_1_1_label = to_list(s4_1_1,s_1_label)
s5_1_1_label = to_list(s5_1_1,s_1_label)
s6_1_1_label = to_list(s6_1_1,s_1_label)
s1_1_2_label = to_list(s1_1_2,s_1_label)
s2_1_2_label = to_list(s2_1_2,s_1_label)
s3_1_2_label = to_list(s3_1_2,s_1_label)
s4_1_2_label = to_list(s4_1_2,s_1_label)
s5_1_2_label = to_list(s5_1_2,s_1_label)
s6_1_2_label = to_list(s6_1_2,s_1_label)


s1_new_1_label = to_list(s1_new_1,s_new_label)
s2_new_1_label = to_list(s2_new_1,s_new_label)
s3_new_1_label = to_list(s3_new_1,s_new_label)
s4_new_1_label = to_list(s4_new_1,s_new_label)
s5_new_1_label = to_list(s5_new_1,s_new_label)
s6_new_1_label = to_list(s6_new_1,s_new_label)
s1_new_2_label = to_list(s1_new_2,s_new_label)
s2_new_2_label = to_list(s2_new_2,s_new_label)
s3_new_2_label = to_list(s3_new_2,s_new_label)
s4_new_2_label = to_list(s4_new_2,s_new_label)
s5_new_2_label = to_list(s5_new_2,s_new_label)
s6_new_2_label = to_list(s6_new_2,s_new_label)


# 모든 변수를 합치는 코드
all_labels = (
    s1_1_1_label + s2_1_1_label + s3_1_1_label + s4_1_1_label + s5_1_1_label + s6_1_1_label +
    s1_1_2_label + s2_1_2_label + s3_1_2_label + s4_1_2_label + s5_1_2_label + s6_1_2_label +
    s1_new_1_label + s2_new_1_label + s3_new_1_label + s4_new_1_label + s5_new_1_label + s6_new_1_label +
    s1_new_2_label + s2_new_2_label + s3_new_2_label + s4_new_2_label + s5_new_2_label + s6_new_2_label
)


import pandas as pd
columns = ["article_number", "clause_number", "sub_clause_number", "unfair_label", "law_acticle", "content"]
df = pd.DataFrame(all_labels, columns=columns)
df.to_csv("./Data_Analysis/Data_ver2/Data/unfair_article_15_train.csv", index=False, encoding="utf-8-sig")



t1_1_1_label = to_list(t1_1_1,s_1_label)
t2_1_1_label = to_list(t2_1_1,s_1_label)
t3_1_1_label = to_list(t3_1_1,s_1_label)

t1_new_1_label = to_list(t1_new_1,s_new_label)
t2_new_1_label = to_list(t2_new_1,s_new_label)
t3_new_1_label = to_list(t3_new_1,s_new_label)

test_labels = (
    t1_1_1_label + t2_1_1_label + t3_1_1_label +
    t1_new_1_label + t2_new_1_label + t3_new_1_label
)

import pandas as pd
columns = ["article_number", "clause_number", "sub_clause_number", "unfair_label", "law_acticle", "content"]
df = pd.DataFrame(test_labels, columns=columns)
df.to_csv("./Data_Analysis/Data_ver2/Data/unfair_article_15_test.csv", index=False, encoding="utf-8-sig")
